const defaultList = [
    {
        "id": "19",
        "text": "Автомобильный бизнес",
        "items": [
            {
                "id": "4",
                "text": "Автомойщик",

            },
            {
                "id": "5",
                "text": "Автослесарь, автомеханик",
            },
            {
                "id": "62",
                "text": "Мастер-приемщик",
            },
            {
                "id": "70",
                "text": "Менеджер по продажам, менеджер по работе с клиентами",
            }
        ]
    },
    {
        "id": "5",
        "text": "Административный персонал",
        "items": [
            {
                "id": "8",
                "text": "Администратор",

            },
            {
                "id": "33",
                "text": "Делопроизводитель, архивариус",

            },
            {
                "id": "58",
                "text": "Курьер",

            },
            {
                "id": "76",
                "text": "Менеджер/руководитель АХО",

            },
            {
                "id": "84",
                "text": "Оператор ПК, оператор базы данных",

            },
            {
                "id": "88",
                "text": "Офис-менеджер",

            },
            {
                "id": "93",
                "text": "Переводчик",

            },
            {
                "id": "110",
                "text": "Секретарь, помощник руководителя, ассистент",

            }
        ]
    },
    {
        "id": "15",
        "text": "Безопасность",
        "items": [
            {
                "id": "22",
                "text": "Военнослужащий",

            },
            {
                "id": "90",
                "text": "Охранник",

            },
            {
                "id": "95",
                "text": "Полицейский",

            },
            {
                "id": "116",
                "text": "Специалист по информационной безопасности",

            },
            {
                "id": "120",
                "text": "Специалист службы безопасности",

            }
        ]
    },
    {
        "id": "26",
        "text": "Высший менеджмент",
        "items": [
            {
                "id": "26",
                "text": "Генеральный директор, исполнительный директор (CEO)",

            },
            {
                "id": "36",
                "text": "Директор по информационным технологиям (CIO)",

            },
            {
                "id": "37",
                "text": "Директор по маркетингу и PR (CMO)",

            },
            {
                "id": "38",
                "text": "Директор по персоналу (HRD)",

            },
            {
                "id": "53",
                "text": "Коммерческий директор (CCO)",

            },
            {
                "id": "80",
                "text": "Начальник производства",

            },
            {
                "id": "87",
                "text": "Операционный директор (COO)",

            },
            {
                "id": "125",
                "text": "Технический директор (CTO)",

            },
            {
                "id": "135",
                "text": "Финансовый директор (CFO)",

            }
        ]
    },
    {
        "id": "8",
        "text": "Добыча сырья",
        "items": [
            {
                "id": "27",
                "text": "Геодезист",

            },
            {
                "id": "28",
                "text": "Геолог",

            },
            {
                "id": "49",
                "text": "Инженер-технолог",

            },
            {
                "id": "63",
                "text": "Машинист",

            },
            {
                "id": "79",
                "text": "Научный специалист, исследователь, лаборант",

            }
        ]
    },
    {
        "id": "16",
        "text": "Домашний, обслуживающий персонал",
        "items": [
            {
                "id": "8",
                "text": "Администратор",

            },
            {
                "id": "21",
                "text": "Водитель",

            },
            {
                "id": "32",
                "text": "Дворник",

            },
            {
                "id": "58",
                "text": "Курьер",

            },
            {
                "id": "89",
                "text": "Официант, бармен, бариста",

            },
            {
                "id": "90",
                "text": "Охранник",

            },
            {
                "id": "130",
                "text": "Уборщица, уборщик",

            }
        ]
    },
    {
        "id": "14",
        "text": "Закупки",
        "items": [
            {
                "id": "66",
                "text": "Менеджер по закупкам",

            },
            {
                "id": "119",
                "text": "Специалист по тендерам",

            }
        ]
    },
    {
        "id": "11",
        "text": "Информационные технологии",
        "items": [
            {
                "id": "10",
                "text": "Аналитик",

            },
            {
                "id": "12",
                "text": "Арт-директор, креативный директор",

            },
            {
                "id": "25",
                "text": "Гейм-дизайнер",

            },
            {
                "id": "34",
                "text": "Дизайнер, художник",

            },
            {
                "id": "36",
                "text": "Директор по информационным технологиям (CIO)",

            },
            {
                "id": "73",
                "text": "Менеджер продукта",

            },
            {
                "id": "96",
                "text": "Программист, разработчик",

            },
            {
                "id": "104",
                "text": "Руководитель группы разработки",

            },
            {
                "id": "107",
                "text": "Руководитель проектов",

            },
            {
                "id": "112",
                "text": "Сетевой инженер",

            },
            {
                "id": "113",
                "text": "Системный администратор",

            },
            {
                "id": "114",
                "text": "Системный инженер",

            },
            {
                "id": "116",
                "text": "Специалист по информационной безопасности",

            },
            {
                "id": "121",
                "text": "Специалист технической поддержки",

            },
            {
                "id": "124",
                "text": "Тестировщик",

            },
            {
                "id": "125",
                "text": "Технический директор (CTO)",

            },
            {
                "id": "126",
                "text": "Технический писатель",

            }
        ]
    },
    {
        "id": "24",
        "text": "Искусство, развлечения, масс-медиа",
        "items": [
            {
                "id": "12",
                "text": "Арт-директор, креативный директор",

            },
            {
                "id": "13",
                "text": "Артист, актер, аниматор",

            },
            {
                "id": "20",
                "text": "Видеооператор, видеомонтажер",

            },
            {
                "id": "25",
                "text": "Гейм-дизайнер",

            },
            {
                "id": "34",
                "text": "Дизайнер, художник",

            },
            {
                "id": "41",
                "text": "Журналист, корреспондент",

            },
            {
                "id": "55",
                "text": "Копирайтер, редактор, корректор",

            },
            {
                "id": "98",
                "text": "Продюсер",

            },
            {
                "id": "103",
                "text": "Режиссер, сценарист",

            },
            {
                "id": "139",
                "text": "Фотограф, ретушер",

            }
        ]
    },
    {
        "id": "6",
        "text": "Маркетинг, реклама, PR",
        "items": [
            {
                "id": "1",
                "text": "Event-менеджер",

            },
            {
                "id": "2",
                "text": "PR-менеджер",

            },
            {
                "id": "3",
                "text": "SMM-менеджер, контент-менеджер",

            },
            {
                "id": "10",
                "text": "Аналитик",

            },
            {
                "id": "12",
                "text": "Арт-директор, креативный директор",

            },
            {
                "id": "34",
                "text": "Дизайнер, художник",

            },
            {
                "id": "37",
                "text": "Директор по маркетингу и PR (CMO)",

            },
            {
                "id": "55",
                "text": "Копирайтер, редактор, корректор",

            },
            {
                "id": "68",
                "text": "Менеджер по маркетингу и рекламе",

            },
            {
                "id": "70",
                "text": "Менеджер по продажам, менеджер по работе с клиентами",

            },
            {
                "id": "71",
                "text": "Менеджер по работе с партнерами",

            },
            {
                "id": "99",
                "text": "Промоутер",

            }
        ]
    },
    {
        "id": "23",
        "text": "Медицина, фармацевтика",
        "items": [
            {
                "id": "8",
                "text": "Администратор",

            },
            {
                "id": "15",
                "text": "Ассистент врача",

            },
            {
                "id": "19",
                "text": "Ветеринарный врач",

            },
            {
                "id": "24",
                "text": "Врач",

            },
            {
                "id": "29",
                "text": "Главный врач, заведующий отделением",

            },
            {
                "id": "42",
                "text": "Заведующий аптекой",

            },
            {
                "id": "64",
                "text": "Медицинская сестра",

            },
            {
                "id": "65",
                "text": "Медицинский представитель",

            },
            {
                "id": "133",
                "text": "Фармацевт-провизор",

            }
        ]
    },
    {
        "id": "25",
        "text": "Наука, образование",
        "items": [
            {
                "id": "17",
                "text": "Бизнес-тренер",

            },
            {
                "id": "23",
                "text": "Воспитатель, няня",

            },
            {
                "id": "79",
                "text": "Научный специалист, исследователь, лаборант",

            },
            {
                "id": "101",
                "text": "Психолог",

            },
            {
                "id": "132",
                "text": "Учитель, преподаватель, педагог",

            }
        ]
    },
    {
        "id": "1",
        "text": "Продажи, обслуживание клиентов",
        "items": [
            {
                "id": "6",
                "text": "Агент по недвижимости",

            },
            {
                "id": "10",
                "text": "Аналитик",

            },
            {
                "id": "51",
                "text": "Кассир-операционист",

            },
            {
                "id": "53",
                "text": "Коммерческий директор (CCO)",

            },
            {
                "id": "54",
                "text": "Координатор отдела продаж",

            },
            {
                "id": "57",
                "text": "Кредитный специалист",

            },
            {
                "id": "70",
                "text": "Менеджер по продажам, менеджер по работе с клиентами",

            },
            {
                "id": "71",
                "text": "Менеджер по работе с партнерами",

            },
            {
                "id": "83",
                "text": "Оператор call-центра, специалист контактного центра",

            },
            {
                "id": "97",
                "text": "Продавец-консультант, продавец-кассир",

            },
            {
                "id": "105",
                "text": "Руководитель отдела клиентского обслуживания",

            },
            {
                "id": "106",
                "text": "Руководитель отдела продаж",

            },
            {
                "id": "121",
                "text": "Специалист технической поддержки",

            },
            {
                "id": "122",
                "text": "Страховой агент",

            },
            {
                "id": "129",
                "text": "Торговый представитель",

            }
        ]
    },
    {
        "id": "7",
        "text": "Производство, сервисное обслуживание",
        "items": [
            {
                "id": "44",
                "text": "Инженер по качеству",

            },
            {
                "id": "45",
                "text": "Инженер по охране труда и технике безопасности",

            },
            {
                "id": "46",
                "text": "Инженер по эксплуатации",

            },
            {
                "id": "48",
                "text": "Инженер-конструктор, инженер-проектировщик",

            },
            {
                "id": "49",
                "text": "Инженер-технолог",

            },
            {
                "id": "63",
                "text": "Машинист",

            },
            {
                "id": "79",
                "text": "Научный специалист, исследователь, лаборант",

            },
            {
                "id": "80",
                "text": "Начальник производства",

            },
            {
                "id": "82",
                "text": "Начальник смены, мастер участка",

            },
            {
                "id": "85",
                "text": "Оператор производственной линии",

            },
            {
                "id": "86",
                "text": "Оператор станков с ЧПУ",

            },
            {
                "id": "109",
                "text": "Сварщик",

            },
            {
                "id": "111",
                "text": "Сервисный инженер, механик",

            },
            {
                "id": "115",
                "text": "Слесарь",

            },
            {
                "id": "128",
                "text": "Токарь, фрезеровщик, шлифовщик",

            },
            {
                "id": "141",
                "text": "Швея, портной, закройщик",

            },
            {
                "id": "143",
                "text": "Электромонтажник",

            },
            {
                "id": "144",
                "text": "Энергетик",

            }
        ]
    },
    {
        "id": "17",
        "text": "Рабочий персонал",
        "items": [
            {
                "id": "5",
                "text": "Автослесарь, автомеханик",

            },
            {
                "id": "21",
                "text": "Водитель",

            },
            {
                "id": "31",
                "text": "Грузчик",

            },
            {
                "id": "52",
                "text": "Кладовщик",

            },
            {
                "id": "59",
                "text": "Маляр, штукатур",

            },
            {
                "id": "63",
                "text": "Машинист",

            },
            {
                "id": "78",
                "text": "Монтажник",

            },
            {
                "id": "85",
                "text": "Оператор производственной линии",

            },
            {
                "id": "86",
                "text": "Оператор станков с ЧПУ",

            },
            {
                "id": "102",
                "text": "Разнорабочий",

            },
            {
                "id": "109",
                "text": "Сварщик",

            },
            {
                "id": "111",
                "text": "Сервисный инженер, механик",

            },
            {
                "id": "115",
                "text": "Слесарь",

            },
            {
                "id": "128",
                "text": "Токарь, фрезеровщик, шлифовщик",

            },
            {
                "id": "131",
                "text": "Упаковщик, комплектовщик",

            },
            {
                "id": "143",
                "text": "Электромонтажник",

            }
        ]
    },
    {
        "id": "2",
        "text": "Розничная торговля",
        "items": [
            {
                "id": "9",
                "text": "Администратор магазина, администратор торгового зала",

            },
            {
                "id": "35",
                "text": "Директор магазина, директор сети магазинов",

            },
            {
                "id": "77",
                "text": "Мерчендайзер",

            },
            {
                "id": "97",
                "text": "Продавец-консультант, продавец-кассир",

            },
            {
                "id": "99",
                "text": "Промоутер",

            },
            {
                "id": "123",
                "text": "Супервайзер",

            },
            {
                "id": "127",
                "text": "Товаровед",

            }
        ]
    },
    {
        "id": "9",
        "text": "Сельское хозяйство",
        "items": [
            {
                "id": "7",
                "text": "Агроном",

            },
            {
                "id": "19",
                "text": "Ветеринарный врач",

            },
            {
                "id": "43",
                "text": "Зоотехник",

            },
            {
                "id": "49",
                "text": "Инженер-технолог",

            },
            {
                "id": "63",
                "text": "Машинист",

            }
        ]
    },
    {
        "id": "21",
        "text": "Спортивные клубы, фитнес, салоны красоты",
        "items": [
            {
                "id": "8",
                "text": "Администратор",

            },
            {
                "id": "56",
                "text": "Косметолог",

            },
            {
                "id": "60",
                "text": "Массажист",

            },
            {
                "id": "61",
                "text": "Мастер ногтевого сервиса",

            },
            {
                "id": "70",
                "text": "Менеджер по продажам, менеджер по работе с клиентами",

            },
            {
                "id": "92",
                "text": "Парикмахер",

            },
            {
                "id": "138",
                "text": "Фитнес-тренер, инструктор тренажерного зала",

            }
        ]
    },
    {
        "id": "4",
        "text": "Стратегия, инвестиции, консалтинг",
        "items": [
            {
                "id": "10",
                "text": "Аналитик",

            },
            {
                "id": "75",
                "text": "Менеджер/консультант по стратегии",

            },
            {
                "id": "107",
                "text": "Руководитель проектов",

            },
            {
                "id": "134",
                "text": "Финансовый аналитик, инвестиционный аналитик",

            }
        ]
    },
    {
        "id": "22",
        "text": "Страхование",
        "items": [
            {
                "id": "11",
                "text": "Андеррайтер",

            },
            {
                "id": "91",
                "text": "Оценщик",

            },
            {
                "id": "122",
                "text": "Страховой агент",

            }
        ]
    },
    {
        "id": "18",
        "text": "Строительство, недвижимость",
        "items": [
            {
                "id": "6",
                "text": "Агент по недвижимости",

            },
            {
                "id": "14",
                "text": "Архитектор",

            },
            {
                "id": "27",
                "text": "Геодезист",

            },
            {
                "id": "30",
                "text": "Главный инженер проекта",

            },
            {
                "id": "34",
                "text": "Дизайнер, художник",

            },
            {
                "id": "47",
                "text": "Инженер ПТО, инженер-сметчик",

            },
            {
                "id": "46",
                "text": "Инженер по эксплуатации",

            },
            {
                "id": "59",
                "text": "Маляр, штукатур",

            },
            {
                "id": "63",
                "text": "Машинист",

            },
            {
                "id": "78",
                "text": "Монтажник",

            },
            {
                "id": "100",
                "text": "Прораб, мастер СМР",

            },
            {
                "id": "102",
                "text": "Разнорабочий",

            },
            {
                "id": "108",
                "text": "Руководитель строительного проекта",

            },
            {
                "id": "109",
                "text": "Сварщик",

            },
            {
                "id": "115",
                "text": "Слесарь",

            },
            {
                "id": "143",
                "text": "Электромонтажник",

            }
        ]
    },
    {
        "id": "10",
        "text": "Транспорт, логистика, перевозки",
        "items": [
            {
                "id": "21",
                "text": "Водитель",

            },
            {
                "id": "31",
                "text": "Грузчик",

            },
            {
                "id": "39",
                "text": "Диспетчер",

            },
            {
                "id": "52",
                "text": "Кладовщик",

            },
            {
                "id": "58",
                "text": "Курьер",

            },
            {
                "id": "67",
                "text": "Менеджер по логистике, менеджер по ВЭД",

            },
            {
                "id": "81",
                "text": "Начальник склада",

            },
            {
                "id": "131",
                "text": "Упаковщик, комплектовщик",

            }
        ]
    },
    {
        "id": "20",
        "text": "Туризм, гостиницы, рестораны",
        "items": [
            {
                "id": "8",
                "text": "Администратор",

            },
            {
                "id": "72",
                "text": "Менеджер по туризму",

            },
            {
                "id": "74",
                "text": "Менеджер ресторана",

            },
            {
                "id": "89",
                "text": "Официант, бармен, бариста",

            },
            {
                "id": "94",
                "text": "Повар, пекарь, кондитер",

            },
            {
                "id": "130",
                "text": "Уборщица, уборщик",

            },
            {
                "id": "140",
                "text": "Хостес",

            }
        ]
    },
    {
        "id": "12",
        "text": "Управление персоналом, тренинги",
        "items": [
            {
                "id": "17",
                "text": "Бизнес-тренер",

            },
            {
                "id": "38",
                "text": "Директор по персоналу (HRD)",

            },
            {
                "id": "69",
                "text": "Менеджер по персоналу",

            },
            {
                "id": "117",
                "text": "Специалист по кадрам",

            },
            {
                "id": "118",
                "text": "Специалист по подбору персонала",

            }
        ]
    },
    {
        "id": "3",
        "text": "Финансы, бухгалтерия",
        "items": [
            {
                "id": "16",
                "text": "Аудитор",

            },
            {
                "id": "18",
                "text": "Бухгалтер",

            },
            {
                "id": "50",
                "text": "Казначей",

            },
            {
                "id": "134",
                "text": "Финансовый аналитик, инвестиционный аналитик",

            },
            {
                "id": "135",
                "text": "Финансовый директор (CFO)",

            },
            {
                "id": "136",
                "text": "Финансовый контролер",

            },
            {
                "id": "137",
                "text": "Финансовый менеджер",

            },
            {
                "id": "142",
                "text": "Экономист",

            }
        ]
    },
    {
        "id": "13",
        "text": "Юристы",
        "items": [
            {
                "id": "145",
                "text": "Юрисконсульт",

            },
            {
                "id": "146",
                "text": "Юрист",

            }
        ]
    },
    {
        "id": "27",
        "text": "Другое",
        "items": [
            {
                "id": "40",
                "text": "Другое",

            }
        ]
    }
]

const listIndustries = []

defaultList.forEach((industry, index)=>{
    let area = []
    industry.items.forEach((workArea, index)=>{
        area.push({
            id: index+1,
            name: workArea.text
        })
    })
    listIndustries.push({
        id: index+1,
        name: industry.text,
        workAreas: area
    })
})

export default listIndustries
